app/views/static_pages/home.html.erb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
				<tr>
					<th><%= Book.find_by(id: i.book_id).name %></th>

SELECT "borrowings".* FROM "borrowings" WHERE "borrowings"."user_id" = ?  [["user_id", 101]]
---
            <% else %>
              <%= form_for(current_user.borrowings.find_by(user_id: current_user.id, book_id: Book.find_by(id: i.book_id).id), html: { method: :patch }, class: 'form-inline', style: 'display:inline !important;') do |f| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
					<th><%= book.author %></th>
					<th><%= User.find_by(id: i.user_id).name %></th>