app/views/books/show.html.erb

        <% @borrowings.each do |i| %>
          <th><%= User.find_by(id: i.user_id).name %></th>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]