app/controllers/books_controller.rb

	def index
		@books = Book.search(params[:search]).paginate(page: params[:page], per_page: 10)
---
SELECT  "books".* FROM "books" WHERE (name like '%consider%') LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "books" WHERE (name like '%consider%')

  def update
  	@book = Book.find(params[:id])
  	if @book.update_attributes(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "books" SET "genre" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["genre", "#<Dewey:0x007f27c23a8978>"], ["updated_at", 2017-12-14 08:22:38 UTC], ["id", 9]]