app/controllers/borrowings_controller.rb

	def create
		@book = Book.find(params[:book_id])
		@user = current_user
		unless owed_book?
			if @book.availability == 0
				flash[:danger] = "This book is not available"
			elsif @user.number_of_borrowed_books < 5
				@borrowing = Borrowing.create(user_id: params[:user_id],
																			book_id: params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "borrowings" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 101], ["book_id", 1], ["created_at", 2017-11-17 02:33:27 UTC], ["updated_at", 2017-11-17 02:33:27 UTC]]