app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.role = "user"
    if @user.save
---
INSERT INTO "users" ("name", "role", "email", "birthday", "address", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)